Repository: vb64/pipeline.integrity
Catalog: pipeline_integrity/method/asme/locale/*/LC_MESSAGES/messages.po
Languages: ru

source: The relative defect depth == defect depth / pipe wall thickness * 100%.
ru: Относительная глубина дефекта == глубина / толщина стенки * 100%.

source: The relative defect depth less than {}% from wall thickness.
ru: Относительная глубина дефекта меньше {}% толщины стенки.

source: The defect is not dangerous.
ru: Дефект не опасен.

source: The relative defect depth greater than {}% from wall thickness.
ru: Относительная глубина дефекта больше {}% толщины стенки.

source: The defect needs to be repaired.
ru: Дефект нужно ремонтировать.

source: The length of the defect {} does not exceed the maximum allowable length {}.
ru: Длина дефекта {} не превышает максимально допустимую длину {}.

source: The length of the defect {} exceed the maximum allowable length {}.
ru: Длина дефекта {} превышает максимально допустимую длину {}.

source: It is necessary to calculate the allowable pressure for defect.
ru: Необходимо рассчитать допустимое давление для дефекта.

source: The working pressure {} does not exceed the allowable pressure {}.
ru: Рабочее давление {} не превышает допустимое давление {}.

source: Repair or pressure reduction to {} required.
ru: Необходим ремонт или снижение давления до {}.

source: Parameter B.
ru: Параметр B.

source: The relative defect depth {} less than {}%.
ru: Относительная глубина дефекта {} меньше {}%.

source: Set Parameter B value to {}.
ru: Параметр B ghbybvftncz hfdysv {}.

source: The relative defect depth {} more than {}%.
ru: Относительная глубина дефекта {} больше {}%.

source: Calculation of the maximum allowable defect length.
ru: Расчет максимально допустимой длины дефекта.

source: Calculation of the maximum allowable pressure.
ru: Расчет максимально допустимого давления.

source: Parameter A for defect length {}.
ru: Параметр A для дефекта длиной {}.

source: Design pressure.
ru: Расчетное давление.

source: Parameter A more than 4.
ru: Параметр A больше 4.

source: Parameter A less than 4.
ru: Параметр A меньше 4.

source: Safe pressure {} more than design pressure {}.
ru: Безопасное давление {} превышает расчетное давление {}.

source: Use design pressure {} as maximum allowable pressure.
ru: Используем расчетное давление как максимально допустимое давление.

source: Use safe pressure {} as maximum allowable pressure.
ru: Используем безопасное давление как максимально допустимое давление.

source: Parameter Z = length^2 / (diameter * wallthickness).
ru: Параметр Z = длина^2 / (диаметр * толщина).

source: Parameter M = sqrt(1 + 0.8 * Z).
ru: Параметр M = sqrt(1 + 0.8 * Z).

source: Parameter Sflow = 1.1 * material_smys.
ru: Параметр Sflow = 1.1 * предел_текучести.

source: Parameter Sflow > material SMTS.
ru: Параметр Sflow > предела прочности при растяжении материала.

source: Use material SMTS as Sflow = {}.
ru: Используем предел прочности при растяжении материала как параметр Sflow.

source: Calculate failure stress level by the classic way.
ru: Вычисляем величину напряжения разрыва классическим методом.

source: Parameter Z = {} <= 20.
ru: Параметр Z = {} <= 20.

source: Failure stress level = Sflow * (1 - 2/3 * (depth / wallthickness)) / (1 - 2/3 * (depth / wallthickness) / M).
ru: Напряжение разрыва = Sflow * (1 - 2/3 * (глубина / толщина)) / (1 - 2/3 * (глубина / толщина) / M).

source: Parameter Z = {} > 20.
ru: Параметр Z = {} > 20.

source: Failure stress level = Sflow * (1 - depth / wallthickness).
ru: Напряжение разрыва = Sflow * (1 - глубина / толщина).

source: Calculate failure stress level by the modified way.
ru: Вычисляем величину напряжения разрыва модифицированным методом.

source: Parameter Z = {} <= 50.
ru: Параметр Z = {} <= 50.

source: Parameter M = sqrt(1 + 0.6275 * Z - 0.003375 * Z^2)
ru: Параметр M = sqrt(1 + 0.6275 * Z - 0.003375 * Z^2)

source: Parameter Z = {} > 50.
ru: Параметр Z = {} > 50.

source: Parameter M = 0.032 * Z + 3.3
ru: Параметр M = 0.032 * Z + 3.3

source: Failure stress level = Sflow * (1 - 0.85 * (depth / wallthickness)) / (1 - 0.85 * (depth / wallthickness) / M).
ru: Напряжение разрыва = Sflow * (1 - 0.85 * (глубина / толщина)) / (1 - 0.85 * (глубина / толщина) / M).

source: Failure pressure = 2 * stress_fail * wallthickness / diameter.
ru: Давление разрыва = 2 * stress_fail * толщина / диаметр.

source: modified
ru: модифицированный

source: classic
ru: классический

source: Calculate ERF by {} {}.
ru: Вычисляем КБД по {} {}.

source: ERF = pipe_maop / press_fail.
ru: КБД = рабочее_давление / давление_разрыва.

source: Repair required immediately, years to repair: 0.
ru: Необходим ремонт, лет до ремонта: 0.

source: Repair is not required at the moment, calculate the time before repair.
ru: На данный момент ремонт не требуется, вычисляем время до ремонта.

source: With corrosion rate {} mm/year, pipe wall {} and depth {} a through hole is formed after years: {}.
ru: При скорости коррозии {} мм/год, толщине стенки {} и глубине дефекта {}, сквозной дефект образуется через лет: {}.

source: But even a through defect does not require repair.
ru: Но даже сквозной дефект не нуждается в ремонте.

source: ERF = {}. Use special value for years: 777.
ru: КБД = {}. Используем специальное значение 777 для годов до ремонта.

source: Calculating the year in which the corrosion growth of the defect will require repair.
ru: Вычисляем через сколько лет дефект потребует ремонта при заданной скорости коррозии.

source: Years: {} ERF: {}.
ru: Года: {} КБД: {}.

source: Defect will require repair after years: {}.
ru: Дефект нужно будет отремонтировать через лет: {}.
